In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
# unique values
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
# number of unique values
df['col2'].nunique()

3

In [5]:
# selecting data
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [6]:
# apply functions
def times2(x):
    return x*2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [7]:
# apply build in functions
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [8]:
# apply lambda expression
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [9]:
# get columns name
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [10]:
# get indexs
df.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
# sorting & ordering
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [12]:
# check null values
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False